# 시리즈 만들기

In [1]:
#    https://pandas.pydata.org/docs/reference/index.html   api document에서 찾아서 필요한거

In [2]:
import pandas as pd
s= pd.Series(['banana',42])

In [3]:
s   # banana는 문자지만 42는 숫자니깐 먼저 시리즈로 묶어서 전체를 문자(Object)로 만든다.

0    banana
1        42
dtype: object

In [4]:
s = pd.Series(['mckinney','create of pandas','numpy'],index=['person','who','num'])  #인덱스를 지정할 수 있다.   numpy는 파이썬의 빅데이터 라이브러리이며 기본적으로 array(행렬)라는 단위 데이터 
s

person            mckinney
who       create of pandas
num                  numpy
dtype: object

In [5]:
s = pd.Series([23.0,56.0])  # 둘다 시리즈로 묶어서 공통된 float로 만든다.
s

0    23.0
1    56.0
dtype: float64

# 데이터프레임 만들기

In [6]:
#데이터프레임은 dictionaly로 만드는게 가장 일반적이다.
data = {
    'name' : ['franklin','Gosset'], #앞의 키값이 컬럼이 되고 뒤의 value가 데이터가 된다.
    'Occupation' : ['Chemist','Statistician'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age' : [37,61]
    
}

scientists = pd.DataFrame(data)
scientists

       name    Occupation        Born        Died  Age
0  franklin       Chemist  1920-07-25  1958-04-16   37
1    Gosset  Statistician  1876-06-13  1937-10-16   61

In [7]:
scientists = pd.DataFrame(data,index=['Rosaline Franklin','William Gosset']) #이건 index를 설정해준다.
scientists

                       name    Occupation        Born        Died  Age
Rosaline Franklin  franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset       Gosset  Statistician  1876-06-13  1937-10-16   61

In [8]:
scientists = pd.DataFrame(data,index=['Rosaline Franklin','William Gosset'],columns=['name','Born','Died','Age','Occupation']) #이건 index를 설정해준다.
scientists

                       name        Born        Died  Age    Occupation
Rosaline Franklin  franklin  1920-07-25  1958-04-16   37       Chemist
William Gosset       Gosset  1876-06-13  1937-10-16   61  Statistician

In [9]:

moviedf = pd.read_pickle('../data/moviedf.pkl')

In [10]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [11]:
scientists.values

array([['franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician']],
      dtype=object)

In [12]:
scientists.keys

<bound method NDFrame.keys of                        name        Born        Died  Age    Occupation
Rosaline Franklin  franklin  1920-07-25  1958-04-16   37       Chemist
William Gosset       Gosset  1876-06-13  1937-10-16   61  Statistician>

In [13]:
moviedf.index

RangeIndex(start=0, stop=10, step=1)

In [14]:
moviedf.keys

<bound method NDFrame.keys of   rank                     movieNm_list openDt_list audiCnt_list
0    1                      다만 악에서 구하소서  2020-08-05        26421
1    2                           오케이 마담  2020-08-12        13944
2    3  극장판 짱구는 못말려: 신혼여행 허리케인~ 사라진 아빠!  2020-08-20         5346
3    4                       강철비2: 정상회담  2020-07-29         1987
4    5                          반교: 디텐션  2020-08-13         1585
5    6                              메멘토  2001-08-24         1351
6    7                               반도  2020-07-15         1103
7    8                           시크릿 가든  2020-08-19         1000
8    9                          남매의 여름밤  2020-08-20          872
9   10                              인셉션  2010-07-21          790>

In [15]:
moviedf['movieNm_list'].keys

<bound method Series.keys of 0                        다만 악에서 구하소서
1                             오케이 마담
2    극장판 짱구는 못말려: 신혼여행 허리케인~ 사라진 아빠!
3                         강철비2: 정상회담
4                            반교: 디텐션
5                                메멘토
6                                 반도
7                             시크릿 가든
8                            남매의 여름밤
9                                인셉션
Name: movieNm_list, dtype: object>

In [16]:
moviedf.columns

Index(['rank', 'movieNm_list', 'openDt_list', 'audiCnt_list'], dtype='object')

In [17]:
ages = scientists['Age']
ages
ages.count()
ages.min()

37

In [18]:
scientists.mean()  #dataFrame

Age    49.0
dtype: float64

In [19]:
moviedf.mean()

rank            1.234568e+09
audiCnt_list    2.642114e+38
dtype: float64

In [20]:
ages.std() #표준편차
ages.var() #분산
ages.describe() #

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

In [21]:
sci = pd.read_csv('../data/scientists.csv')

In [22]:
ages= sci['Age']
ages.max()

90

In [23]:
ages
ages.min()
ages.mean()

59.125

In [24]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [25]:
ages[ages>=ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [26]:
ages>=ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [27]:
ages[[False,True,True,True,False,False,False,True]]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [28]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [29]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [30]:
rev_ages = ages.sort_index(ascending=False) #False면 내림차순   리버스(역순)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [31]:
rev_ages + pd.Series([1,100])  #이렇게 해도 상관없다. 위에서 역순으로 만들어놨지만 pd.Series([1,100])의 인덱스는 0,1 이니깐

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [32]:
pd.Series([1,100],index=[2,3])

2      1
3    100
dtype: int64

In [33]:
sci.sort_index(axis=1,ascending=False)  #컬럼명이 알파벳순으로 정렬이된다. 
#axis=0 은 첫번째 행이 되는거고 axis=1은 첫번쨰 열이 된다.

           Occupation                  Name        Died        Born  Age
0             Chemist     Rosaline Franklin  1958-04-16  1920-07-25   37
1        Statistician        William Gosset  1937-10-16  1876-06-13   61
2               Nurse  Florence Nightingale  1910-08-13  1820-05-12   90
3             Chemist           Marie Curie  1934-07-04  1867-11-07   66
4           Biologist         Rachel Carson  1964-04-14  1907-05-27   56
5           Physician             John Snow  1858-06-16  1813-03-15   45
6  Computer Scientist           Alan Turing  1954-06-07  1912-06-23   41
7       Mathematician          Johann Gauss  1855-02-23  1777-04-30   77

In [34]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [35]:
 pd.to_datetime(sci['Born'],format='%Y-%m-%d') #이건 저장은 안되고

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [36]:
sci['Born'] = pd.to_datetime(sci['Born'],format='%Y-%m-%d') #이렇게 해서 해당 컬럼의 형식을 바꿀수 있다.+ sci['Born'] 이렇게 해서 저장 시켜준다.

In [37]:
sci['Died'] = pd.to_datetime(sci['Died'],format='%Y-%m-%d')

In [38]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      datetime64[ns]
 2   Died        8 non-null      datetime64[ns]
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 448.0+ bytes

In [39]:
sci.head()

                   Name       Born       Died  Age    Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37       Chemist
1        William Gosset 1876-06-13 1937-10-16   61  Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90         Nurse
3           Marie Curie 1867-11-07 1934-07-04   66       Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56     Biologist

In [40]:
sci['age_days_dt'] = sci['Died']-sci['Born']

In [42]:
sci.head()

                   Name       Born       Died  Age    Occupation age_days_dt
0     Rosaline Franklin 1920-07-25 1958-04-16   37       Chemist  13779 days
1        William Gosset 1876-06-13 1937-10-16   61  Statistician  22404 days
2  Florence Nightingale 1820-05-12 1910-08-13   90         Nurse  32964 days
3           Marie Curie 1867-11-07 1934-07-04   66       Chemist  24345 days
4         Rachel Carson 1907-05-27 1964-04-14   56     Biologist  20777 days

In [43]:
sci.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'age_days_dt'], dtype='object')

In [44]:
sci.drop([1]) #기본은 행단위(axis=0)

TypeError: 'method' object is not subscriptable

In [ ]:
sci.drop(['Age'],axis=1)  #삭제는 되지만 원본에는 삭제가 되지 않음

In [49]:
sci.drop(['Age'],axis=1,inplace=True)  #inplace=True 원본에 적용을 하는것.

                   Name       Born       Died          Occupation age_days_dt
0     Rosaline Franklin 1920-07-25 1958-04-16             Chemist  13779 days
1        William Gosset 1876-06-13 1937-10-16        Statistician  22404 days
2  Florence Nightingale 1820-05-12 1910-08-13               Nurse  32964 days
3           Marie Curie 1867-11-07 1934-07-04             Chemist  24345 days
4         Rachel Carson 1907-05-27 1964-04-14           Biologist  20777 days
5             John Snow 1813-03-15 1858-06-16           Physician  16529 days
6           Alan Turing 1912-06-23 1954-06-07  Computer Scientist  15324 days
7          Johann Gauss 1777-04-30 1855-02-23       Mathematician  28422 days

In [50]:
sci = pd.read_csv('../data/scientists.csv')

In [51]:
sci[sci['Age']>=sci['Age'].mean()] #평균보다 큰것

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [ ]:
인덱스, columns , values

In [52]:
ri = sci[sci['Age']>=sci['Age'].mean()].index #sci에 현재 1237이 있는데

In [53]:
sci.drop(ri,axis=0)  #요렇구롬 해서 1237을 삭제한다

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5          John Snow  1813-03-15  1858-06-16   45           Physician
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

# 데이터프레임에서 시리즈 선택하기

# index, values, keys 사용하기

# 시리즈의 mean, min, max, std 메서드 사용하기

# 시리즈와 불린 추출 사용하기

# 시리즈와 브로드캐스팅

# 데이터프레임과 불린 추출

# 데이터프레임과 브로드캐스팅

# 열의 자료형 바꾸기와 새로운 열 추가하기

# 시리즈, 데이터프레임의 데이터 섞어보기

# 데이터프레임의 열 삭제하기

# 피클 형식으로 저장하기

# CSV 불러오기